{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-WORKFLOW",
    "2": "I-WORKFLOW",
    "3": "B-MACHINE_TYPE",
    "4": "B-MODEL",
    "5": "I-MODEL",
    "6": "B-YEAR",
    "7": "B-REG_NUMBER",
    "8": "B-NAME",
    "9": "I-NAME",
    "10": "B-CONTACT",
    "11": "B-HOURS",
    "12": "B-UNIT",
    "13": "B-FUEL_VOLUME",
    "14": "B-DESCRIPTION",
    "15": "I-DESCRIPTION"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-CONTACT": 10,
    "B-DESCRIPTION": 14,
    "B-FUEL_VOLUME": 13,
    "B-HOURS": 11,
    "B-MACHINE_TYPE": 3,
    "B-MODEL": 4,
    "B-NAME": 8,
    "B-REG_NUMBER": 7,
    "B-UNIT": 12,
    "B-WORKFLOW": 1,
    "B-YEAR": 6,
    "I-DESCRIPTION": 15,
    "I-MODEL": 5,
    "I-NAME": 9,
    "I-WORKFLOW": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.56.2",
  "vocab_size": 119547
}
